package 문제풀이.클래스최종테스트문제.상속이론문제;

public class An {
    //1.자바의 모든 클래스는 Object 클래스를 상속받는다.
    //3.서브클래스,자식클래스
    //자바에서 상속받는 클래스를 서브클래스 라고 부르며,
    // extends 키워드를 이용하여 상속을 선언한다.
    //상속받은 클래스에서 상속해준 클래스의 멤버를 접근할 때 super 키워드를 이용한다.
    //한편, 객체가 어떤 클래스의 타입인지 알아내기
    //5.super(size)
    //6. B: 11
    //7. A클래스의 생성자에 매개변수 i 가 있기때문에 B클래스 생성자에도 super(int i에 들어갈 int가 들어가야함)가 들어가야함.
    //8.    (1) f메소드를 abstract 를 써서 추상 메소드로 선언해주거나 {} 부분을 추가해 본문을 만들어줘야함.
    //      (4) B클래스에 있는 f메소드를 반드시 오버라이딩 해야함.
    //      (5) 클래스 C에서 void로 쓰이기 때문에 int형을 return 하는 메소드를 오버라이딩하거나
    //          B 클래스에서 int를 void로 변경
    //10. 2,3   true,false
    //
}
